<template>
  <div class=""></div>
</template>

<script setup lang="ts">
import { ref } from "vue";

interface ProjectData {
  id: number;
  stack: string;
  task: string;
  description: string;
  features: string;
}

const projectsData = ref<ProjectData[]>([
  {
    id: 1,
    stack: "React.js+Laraver.",
    description:
      "Сервис предназначен для двух сторон: с одной – таксопарки, которые размещают на сайте доступные для брони автомобили, условия аренды и работы с таксистом. С другой – таксист, который видит таксопарки его города и условия работы с ними.",
    task: "Разработать сервис бронирования автомобилей.",
    features:
      "Обе стороны работают через админку с кабинетами. Внутри кабинетов таксопарков есть система распределения ролей. Разработана система управления в виде канбан-доски. Выполнены сторонние интеграции с Я.Картами, Я.Кабинетом, Т-Банк, 1С",
  },
  {
    id: 2,
    stack: "React.js",
    description:
      "район представлен в виде 3D-модели. Путь к новому ЖК лежит через исторические объекты: дома, произвоства. Есть 6 маршрутов движения: 5 – статичные, пользователь движется по подготовленному маршруту от точки А в точку Б. По пути слушает аудио. Шестой маршрут – иммерсивный, выполненный в виде аудиоспектакля. Пользователь движется по ключевым точкам по маршруту. Оказавшись в ней, у него появляется возможность выбрать ситуацию, предложенную в аудиоспектакле. После выбора появляется маршрут до следующей следующей ключевой точки.",
    task: "Разработать рекламный сайт для элитного ЖК, построенного в историческом районе города.",
    features:
      "Продукт реализован в виде 3Д-модели района. Есть панель управления маршрутами, где размещены аудио, видео и текстовые материалы.",
  },
]);

const openProject = (url: string) => {
  window.open(url, "_blank");
};
</script>

<style scoped>
/* Общие стили для страницы проектов */

.c-max-h {
  max-height: calc(100vh - 80px);
  height: calc(100vh - 30px);
}
</style>
